In [1]:
import pandas as pd;

In [2]:
data = pd.DataFrame({
    'name':['vishal', 'om', 'shubz', 'mayur'], 
    'age':[22,33,44,55], 
    'department':['cs', 'IT', 'Chemical', 'Ai-Ml'], 
    'salary':[34222,55533,55222,55111]
})
data

     name  age department  salary
0  vishal   22         cs   34222
1      om   33         IT   55533
2   shubz   44   Chemical   55222
3   mayur   55      Ai-Ml   55111

In [3]:
data['age'] >= 44

0    False
1    False
2     True
3     True
Name: age, dtype: bool

In [6]:
data[(data['name'] == 'vishal') & (data['age'] >= 22)]

     name  age department  salary
0  vishal   22         cs   34222

In [8]:
data.where(data['age'] >= 44)

    name   age department   salary
0    NaN   NaN        NaN      NaN
1    NaN   NaN        NaN      NaN
2  shubz  44.0   Chemical  55222.0
3  mayur  55.0      Ai-Ml  55111.0